string[,] Телефонная_Книга = new string[5, 2];
Телефонная_Книга[0, 0] = "Aнатолий";
Телефонная_Книга[0, 1] = "79304965656 ";
Телефонная_Книга[1, 0] = "Виталий";
Телефонная_Книга[1, 1] = "79308603509 ";
Телефонная_Книга[2, 0] = "Акакий";
Телефонная_Книга[2, 1] = "79305701558 ";
Телефонная_Книга[3, 0] = "Абобий";
Телефонная_Книга[3, 1] = "79308621473 ";
Телефонная_Книга[4, 0] = "Витя";
Телефонная_Книга[4, 1] = "79307043511 ";


for (int i = 0; i < Телефонная_Книга.GetLength(0); i++)
{
    for (int j = 0; j < Телефонная_Книга.GetLength(1); j++)
    {
        System.Console.Write($"{Телефонная_Книга[i, j]} ");
    }
    System.Console.WriteLine();
}
